{
    "experienceWork": [
        {
            "position": "Machine Learning Developer Intern",
            "company": "Pivot Biomedical Engineering Limited",
            "companyLink": "https://pivotbme.com/",
            "time": "Jul 2024 - Aug 2024",
            "address": "Hong Kong, China",
            "work": [
                "Developed RNN and DCNN-based machine learning models using Tensorflow to predict knee joint angles using muscle signals for real-time control of lower limb exoskeletons and prosthetics.",
                "Prototyped an AI-powered medical diagnosis chatbot integrating MongoDB, Llama 3.1, and Retrieval-Augmented Generation to streamline medical consultations and provide symptom-based diagnoses through semantic search."
            ]
        },
        {
            "position": "Consulting Intern - Digital",
            "company": "Deloitte",
            "companyLink": "https://www.deloittedigital.com/us/en.html",
            "time": "Jun 2023 - Aug 2023",
            "address": "Hong Kong, China",
            "work": [
                "Optimized ServiceNow workflows to develop strategic portfolios and management dashboards for HR personnel, employees, and customers of 4 large corporations.",
                "Supervised the quality of Chinese-English translations for ServiceNow dashboards by translating an average of 200 Excel cells of notifications per day, ensuring high-quality cross-cultural organizational communications.",
                "Produced concise, real-time meeting minutes distilling key action points and agreements between 2 to 5 stakeholders."
            ]
        },
        {
            "position": "Instructor",
            "company": "Scout Association of Hong Kong (SAHK)",
            "companyLink": "https://www.scout.org.hk/en/",
            "time": "Sep 2022 - Present",
            "address": "Hong Kong, China",
            "work": [
                "Led and coordinated weekly scouting activities for 20 to 40 youths, including workshops, hikes, and camps.",
                "Awarded the Venture Scout Award and Chief Scout Award after over 10 years of scouting.",
                "Mentored 10+ youth patrol leaders to develop their leadership skills and foster personal growth."
            ]
        },
        {
            "position": "Youth Consultant",
            "company": "McDonald's Hong Kong",
            "companyLink": "https://www.scmp.com/events/news/hong-kong/topics/melo-summit-2022/article/3187735/project-melo-hong-kong-youth",
            "time": "Sep 2022 - Present",
            "address": "Hong Kong, China",
            "work": [
                "Co-founded McDonald’s HK’s first youth-led committee, collaborating with Bowtie CEO Fred Ngan and Miss Hong Kong 2015 Winner Louisa Mak.",
                "Curated the ”Coach McNugget Art World” Exhibition for McDonald’s HK’s 40th anniversary of McNuggets, showcasing 20+ nugget-themed artworks by local artists.",
                "Advised McDonald’s CEO Randy Lai and 3 to 5 board members on youth-related business strategies."
            ]
        }
    ],
    "experienceProject": [
        {
            "position": "Developer",
            "project": "MultiModal AI Assistant: A GPT-4o Alternative",
            "projectLink": null,
            "time": "Jun 2024 - Present",
            "address": "Hong Kong, China",
            "work": [
                "Engineering a custom AI assistant leveraging Llama 3.1 for communication, Gemini Flash 1.5 for screen and camera computer vision, and Azure to generate lifelike audio outputs to simulate natural conversations. This project was motivated by the fact that OpenAI isn’t available in Hong Kong.",
                "Facilitating my language learning in Thai, Mandarin, Cantonese, and Spanish by developing a polyglot system capable of communication in 100+ languages with 400+ realistic voice options."
            ]
        },
        {
            "position": "Developer",
            "project": "AI Algorithmic Trading Bot",
            "projectLink": null,
            "time": "Jun 2024 - Present",
            "address": "Hong Kong, China",
            "work": [
                "Leveraged Alpaca and Lumibot library for basic algorithmic trading through YouTube tutorials and documentation.",
                "Backtested strategies using sentiment analysis of historical news headlines using PyTorch and Hugging Face models."
            ]
        },
        {
            "position": "ETF Trading Student Consultant",
            "project": "HKUST Corporate Consulting Project Sponsored by JPMorgan Chase & Co",
            "projectLink": "https://techmgmt.hkust.edu.hk/system/files/internal/2310_TEMG4950L_Syllabus_2023.08.15_Tentative.pdf",
            "time": "Sep 2023 - Jan 2024",
            "address": "Hong Kong, China",
            "work": [
                "Designed a Global ETF Sales Dashboard to aggregate trends from news and social media for JP Morgan Asset Management’s ETF sales team. Achieved 1st place in the competition.",
                "Developed an ETF filtering tool leveraging Llama 2 and MongoDB to accelerate ETF identification for JPM salespeople through RAG semantic search, reducing the time needed to pinpoint promising ETFs for their clients by 70%.",
                "Presented a proof of concept of a customer profiling tool by integrating CRM data from Salesforce, financial news, client meeting logs, and Hugging Face models to dynamically generate 2 to 5 ETF recommendations per month."
            ]
        },
        {
            "position": "Fixed Income Student Analyst / Full-stack Developer",
            "project": "HKUST Corporate Prototyping Project",
            "projectLink": "https://techmgmt.hkust.edu.hk/system/files/internal/2240_TEMG4940C_Syllabus_2023.07.28.pdf",
            "time": "Jun 2023 - Aug 2023",
            "address": "Hong Kong, China",
            "work": [
                "Created a yearly bond pricing and credit spread migration prediction dashboard for 2 corporate banking and fixed-income related sponsors. Led mainly front-end development and achieved 2nd place in the competition.",
                "Built dashboard on Next.js and Google Cloud. Sourced data from Eikon Terminal and Yahoo Finance for machine learning models and identified 62 features used to predict yearly credit rating migrations with 79.71% back-tested accuracy."
            ]
        },
        {
            "position": "Fellow",
            "project": "Project Melo",
            "projectLink": "https://www.projectmelo.com/",
            "time": "Jan 2022 - Present",
            "address": "Hong Kong, China",
            "work": [
                "Engaged with 45+ prominent Hong Kong CEOs and business leaders in social empowerment initiatives.",
                "Selected as one of 20 fellows from a competitive pool of 200+ applicants and collaborated in a team of 4 with the CEOs of McDonald’s HK and Bowtie.",
                "Delivered a TED-style talk to an audience of over 500 CEOs from around the world to advocate our initiatives."
            ]
        },
        {
            "position": "Private Tutor / Software Developer",
            "project": "Questionbank Scraper",
            "projectLink": null,
            "time": "Jan 2022 - Present",
            "address": "Hong Kong, China",
            "work": [
                "Created a Python web scraping tool in 1 week using Selenium to automate question selection from the IB Questionbank to be used as teaching material for weekly tutoring for HL Math, HL Chemistry, and HL Physics.",
                "Increased productivity and improved tutoring experience by decreasing question search time from 1-2 hours per week to just 5 minutes."
            ]
        }
    ]
}
